const TRIP_FULL_DATA = [
  {
    "day": 1,
    "date": "11/29 (五)",
    "title": "秋月古城與銀杏",
    "timeline": [
      {
        "time": "12:30",
        "name": "太原銀杏森林",
        "location": {
          "lat": 33.2725,
          "lng": 130.6389
        },
        "note": "樹林佔地不大，但聚在一起就是比較壯觀，可惜官方開放時間其實是上一週，所幸天氣不錯，黃葉沒有被打落，雖有幾顆都掉光了，但今天尚有銀杏可以欣賞，搭配溫暖陽光，不過銀杏真的臭啊🤣",
        "photo": "images/1_太原銀杏森林.jpg",
        "type": "static"
      },
      {
        "time": "13:52",
        "name": "一條の森ココチ",
        "location": {
          "lat": 33.239913922031405,
          "lng": 130.51382741457704
        },
        "note": "G map上評價不多，問了Grok 發現是另一家名店（隸屬於久留米市知名連鎖「ココチ食堂」）的姊妹店，餐廳環境古宅優美，標準日式庭園被楓葉🍁包圍著，菜色擺設看起來也很日式，但剛好抵達時超過14:00已沒有午餐。\n下午茶的三明治與咖啡與甜點也是很好吃～對於午餐殘念～～～還有喝到草莓冰沙耶👍",
        "photo": "images/1_一條の森ココチ.jpg",
        "type": "custom"
      },
      {
        "time": "14:30",
        "name": "大興善寺",
        "location": {
          "lat": 33.4357,
          "lng": 130.5367
        },
        "note": "楓葉蠻漂亮，其實台階不多，應該約六樓高度，可以一氣呵成，因為是供俸觀音，日式線香味道讓人舒適，再上去還有入院300元的契園可參觀，因為時間關係，此次無入內遊園",
        "photo": "images/1_大興善寺.jpg",
        "type": "static"
      },
      {
        "time": "16:30",
        "name": "秋月城跡",
        "location": {
          "lat": 33.4667,
          "lng": 130.6942
        },
        "note": "",
        "photo": "images/1_秋月城跡.jpg",
        "type": "static"
      },
      {
        "time": "18:17",
        "name": "CoCo壹番屋 中央區今泉店 カレーハウス CoCo壱番屋 中央区今泉店",
        "location": {
          "lat": 33.58671308633782,
          "lng": 130.39840935438295
        },
        "note": "",
        "photo": null,
        "type": "custom"
      },
      {
        "time": "18:20",
        "name": "Matsuya Udon Honten 松屋うどん (あさくら店）",
        "location": {
          "lat": 33.429629567772444,
          "lng": 130.6452613498657
        },
        "note": "本來想吃一頓好的～結果找的餐廳不是客滿就是沒開，超不爽，怕餓著其他人，只好速速找了一間路邊烏冬餐廳，雖然local 但烏冬是好吃的～ 我只覺得今天熱量爆表啊！",
        "photo": "images/1_Matsuya_Udon_Honten_松屋うどん_(あさくら店）.jpg",
        "type": "custom"
      },
      {
        "time": "20:07",
        "name": "秋月住宿Akizuki OKO art+inn",
        "location": {
          "lat": 33.46887342883017,
          "lng": 130.6895596677257
        },
        "note": "整體風格是我喜歡的日式加侘寂風，兩個房間都有衛浴，工區還有廁所耶，有點藝廊風，廚房也讓人覺得舒適",
        "photo": "images/1_秋月住宿Akizuki_OKO_art+inn.jpg",
        "type": "custom"
      },
      {
        "time": "20:42",
        "name": "Family market ",
        "location": {
          "lat": 33.468990031387186,
          "lng": 130.68965784637257
        },
        "note": "去義大利被老闆養壞的習慣，有鹹但是肉奶都香",
        "photo": "images/1_Family_market_.jpg",
        "type": "custom"
      },
      {
        "time": "22:40",
        "name": "路邊橘子一袋",
        "location": {
          "lat": 33.468877777989114,
          "lng": 130.68957733627715
        },
        "note": "",
        "photo": null,
        "type": "custom"
      }
    ]
  },
  {
    "day": 2,
    "date": "11/30 (六)",
    "title": "福岡繁華巡禮",
    "timeline": [
      {
        "time": "12:10",
        "name": "本格迴轉壽司 大河壽司 本格博多回転寿司大河すし",
        "location": {
          "lat": 33.59262073886455,
          "lng": 130.40629650040924
        },
        "note": "進入福岡市區一級戰區之前，挑選一家順路且評價高的旋轉壽司，11:15分抵達時仍需要現在候位，雖說是本地壽司店，大多都是外籍員工，近年來日本開放大量外籍人士來做勞動力工作，我想台灣之後也會是這般常態吧！\n壽司當季魚類選擇不太多，但都是好吃的海鮮種類，點了鰤魚 海膽 鯛魚 鮪魚中腹 紅蝦，都很好吃，有點可惜沒有吃到秋刀魚。開心開心",
        "photo": "images/2_本格迴轉壽司_大河壽司_本格博多回転寿司大河すし.jpg",
        "type": "custom"
      },
      {
        "time": "13:30",
        "name": "一蘭拉麵 總本店",
        "location": {
          "lat": 33.5932,
          "lng": 130.4046
        },
        "note": "不管什麼時候都在排隊，其實沒有吃到也是有點可惜..",
        "photo": null,
        "type": "static"
      },
      {
        "time": "18:10",
        "name": "新光三越買高級水果",
        "location": {
          "lat": 33.59260030928678,
          "lng": 130.40648037723977
        },
        "note": "當大家什麼都不知道什麼都沒講話時，我想買就買了～於是花大錢買麝香葡萄跟草莓🍓，覺得爽",
        "photo": null,
        "type": "custom"
      },
      {
        "time": "18:17",
        "name": "CoCo壹番屋 中央區今泉店 カレーハウス CoCo壱番屋 中央区今泉店",
        "location": {
          "lat": 33.586721139098074,
          "lng": 130.39841875585637
        },
        "note": "是好吃的咖喱飯，剛好點了冬季限定的辣湯咖哩，點了一級辣的程度，我吃覺得會辣耶～～\n為什麼會吃這家店呢！？是因為有訂位的餐廳A跟餐廳B陰錯陽差皆落空⋯⋯ 為了兩位難搞的老公主只好隨意趕快吃，嗚嗚 覺得人生好難\n",
        "photo": "images/2_CoCo壹番屋_中央區今泉店_カレーハウス_CoCo壱番屋_中央区今泉店.jpg",
        "type": "custom"
      },
      {
        "time": "19:51",
        "name": "中州聖誕市集",
        "location": {
          "lat": 33.59262076647979,
          "lng": 130.40629656207525
        },
        "note": "區域很大很廣，雖然人多，但是地大就是不一樣，也比新北的耶誕城規模好上很多，肉眼看是真的很漂亮的！",
        "photo": "images/2_中州聖誕市集.jpg",
        "type": "custom"
      }
    ]
  }
];