const TRIP_FULL_DATA = [
  {
    "day": 1,
    "title": "Day 1",
    "date": "",
    "timeline": [
      {
        "time": "10:00",
        "name": "熊本機場 (KMJ)",
        "location": {
          "lat": 32.8372,
          "lng": 130.8569
        },
        "note": "",
        "photo": "images/1_熊本機場_(KMJ).jpg",
        "type": "transport"
      },
      {
        "time": "12:30",
        "name": "太原銀杏森林",
        "location": {
          "lat": 33.2725,
          "lng": 130.6389
        },
        "note": "樹林佔地不大，但聚在一起就是比較壯觀，可惜官方開放時間其實是上一週，所幸天氣不錯，黃葉沒有被打落，雖有幾顆都掉光了，但今天尚有銀杏可以欣賞，搭配溫暖陽光，不過銀杏真的臭啊🤣",
        "photo": "images/1_太原銀杏森林.jpg",
        "type": "spot"
      },
      {
        "time": "13:52",
        "name": "一條の森ココチ",
        "location": {
          "lat": 33.239913922031405,
          "lng": 130.51382741457704
        },
        "note": "G map上評價不多，問了Grok 發現是另一家名店（隸屬於久留米市知名連鎖「ココチ食堂」）的姊妹店，餐廳環境古宅優美，標準日式庭園被楓葉🍁包圍著，菜色擺設看起來也很日式，但剛好抵達時超過14:00已沒有午餐。\n下午茶的三明治與咖啡與甜點也是很好吃～對於午餐殘念～～～還有喝到草莓冰沙耶👍",
        "photo": "images/1_一條の森ココチ.jpg",
        "type": "custom"
      },
      {
        "time": "14:30",
        "name": "大興善寺",
        "location": {
          "lat": 33.4357,
          "lng": 130.5367
        },
        "note": "楓葉蠻漂亮，其實台階不多，應該約六樓高度，可以一氣呵成，因為是供俸觀音，日式線香味道讓人舒適，再上去還有入院300元的契園可參觀，因為時間關係，此次無入內遊園",
        "photo": "images/1_大興善寺.jpg",
        "type": "spot"
      },
      {
        "time": "16:30",
        "name": "秋月城跡",
        "location": {
          "lat": 33.4667,
          "lng": 130.6942
        },
        "note": "",
        "photo": "images/1_秋月城跡.jpg",
        "type": "spot"
      },
      {
        "time": "18:20",
        "name": "Matsuya Udon Honten 松屋うどん (あさくら店）",
        "location": {
          "lat": 33.429629567772444,
          "lng": 130.6452613498657
        },
        "note": "本來想吃一頓好的～結果找的餐廳不是客滿就是沒開，超不爽，怕餓著其他人，只好速速找了一間路邊烏冬餐廳，雖然local 但烏冬是好吃的～ 我只覺得今天熱量爆表啊！",
        "photo": "images/1_Matsuya_Udon_Honten_松屋うどん_(あさくら店）.jpg",
        "type": "custom"
      },
      {
        "time": "18:30",
        "name": "Akizuki OKO art+inn",
        "location": {
          "lat": 33.46,
          "lng": 130.69
        },
        "note": "",
        "photo": null,
        "type": "hotel"
      },
      {
        "time": "20:07",
        "name": "秋月住宿Akizuki OKO art+inn",
        "location": {
          "lat": 33.46887342883017,
          "lng": 130.6895596677257
        },
        "note": "整體風格是我喜歡的日式加侘寂風，兩個房間都有衛浴，工區還有廁所耶，有點藝廊風，廚房也讓人覺得舒適",
        "photo": "images/1_秋月住宿Akizuki_OKO_art+inn.jpg",
        "type": "custom"
      },
      {
        "time": "20:42",
        "name": "Family market ",
        "location": {
          "lat": 33.468990031387186,
          "lng": 130.68965784637257
        },
        "note": "去義大利被老闆養壞的習慣，有鹹但是肉奶都香",
        "photo": "images/1_Family_market_.jpg",
        "type": "custom"
      },
      {
        "time": "22:40",
        "name": "路邊橘子一袋",
        "location": {
          "lat": 33.468877777989114,
          "lng": 130.68957733627715
        },
        "note": "",
        "photo": null,
        "type": "custom"
      }
    ]
  },
  {
    "day": 2,
    "title": "Day 2",
    "date": "",
    "timeline": [
      {
        "time": "11:30",
        "name": "天神地下街",
        "location": {
          "lat": 33.5915,
          "lng": 130.3989
        },
        "note": "",
        "photo": null,
        "type": "shop"
      },
      {
        "time": "12:10",
        "name": "本格迴轉壽司 大河壽司 本格博多回転寿司大河すし",
        "location": {
          "lat": 33.59262073886455,
          "lng": 130.40629650040924
        },
        "note": "進入福岡市區一級戰區之前，挑選一家順路且評價高的旋轉壽司，11:15分抵達時仍需要現在候位，雖說是本地壽司店，大多都是外籍員工，近年來日本開放大量外籍人士來做勞動力工作，我想台灣之後也會是這般常態吧！\n壽司當季魚類選擇不太多，但都是好吃的海鮮種類，點了鰤魚 海膽 鯛魚 鮪魚中腹 紅蝦，都很好吃，有點可惜沒有吃到秋刀魚。開心開心",
        "photo": "images/2_本格迴轉壽司_大河壽司_本格博多回転寿司大河すし.jpg",
        "type": "custom"
      },
      {
        "time": "13:30",
        "name": "一蘭拉麵 總本店",
        "location": {
          "lat": 33.5932,
          "lng": 130.4046
        },
        "note": "不管什麼時候都在排隊，其實沒有吃到也是有點可惜..",
        "photo": null,
        "type": "food"
      },
      {
        "time": "18:00",
        "name": "中洲屋台",
        "location": {
          "lat": 33.5923,
          "lng": 130.4069
        },
        "note": "",
        "photo": null,
        "type": "food"
      },
      {
        "time": "18:10",
        "name": "新光三越買高級水果",
        "location": {
          "lat": 33.59260030928678,
          "lng": 130.40648037723977
        },
        "note": "當大家什麼都不知道什麼都沒講話時，我想買就買了～於是花大錢買麝香葡萄跟草莓🍓，覺得爽",
        "photo": null,
        "type": "custom"
      },
      {
        "time": "18:17",
        "name": "CoCo壹番屋 中央區今泉店 カレーハウス CoCo壱番屋 中央区今泉店",
        "location": {
          "lat": 33.586721139098074,
          "lng": 130.39841875585637
        },
        "note": "是好吃的咖喱飯，剛好點了冬季限定的辣湯咖哩，點了一級辣的程度，我吃覺得會辣耶～～\n為什麼會吃這家店呢！？是因為有訂位的餐廳A跟餐廳B陰錯陽差皆落空⋯⋯ 為了兩位難搞的老公主只好隨意趕快吃，嗚嗚 覺得人生好難\n",
        "photo": "images/2_CoCo壹番屋_中央區今泉店_カレーハウス_CoCo壱番屋_中央区今泉店.jpg",
        "type": "custom"
      },
      {
        "time": "19:51",
        "name": "中州聖誕市集",
        "location": {
          "lat": 33.59262076647979,
          "lng": 130.40629656207525
        },
        "note": "區域很大很廣，雖然人多，但是地大就是不一樣，也比新北的耶誕城規模好上很多，肉眼看是真的很漂亮的！",
        "photo": "images/2_中州聖誕市集.jpg",
        "type": "custom"
      },
      {
        "time": "20:00",
        "name": "博多 RESOL TRINITY",
        "location": {
          "lat": 33.593,
          "lng": 130.405
        },
        "note": "",
        "photo": null,
        "type": "hotel"
      }
    ]
  },
  {
    "day": 3,
    "title": "Day 3",
    "date": "",
    "timeline": [
      {
        "time": "08:00",
        "name": "超商甜點",
        "location": {
          "lat": 33.595542378037806,
          "lng": 130.40605179008833
        },
        "note": "轉述友人感覺：吃下第一口質地像是奶酪但帶有優洛乳的味道，倘若搭配上一杯咖啡讓人有身在Harbs 的即視感（黑人問號❓）\n我個人是覺得還好啦～～XD",
        "photo": "images/3_超商甜點.jpg",
        "type": "custom"
      },
      {
        "time": "08:14",
        "name": "山水水出咖啡 山水水出珈琲",
        "location": {
          "lat": 33.595562572046504,
          "lng": 130.40604411181053
        },
        "note": "G map評價俗又大碗的咖啡早餐，+100日幣可以有烤土司跟雞蛋🥚是蠻划算的沒錯，我點的是熱美式，沒有特別覺得好喝…\n有一點點浪費肚子的空間",
        "photo": "images/3_山水水出咖啡_山水水出珈琲.jpg",
        "type": "custom"
      },
      {
        "time": "09:51",
        "name": "Full full フルフル パンとワイン",
        "location": {
          "lat": 33.59200191298408,
          "lng": 130.39724967469215
        },
        "note": "福岡明太子麵包排隊名店，來的是天神分店，G map評論說目前還沒有很多人知道，所以10:00開門，我9:50抵達，已有約10人排位，隊伍不算長，但說五分鐘後人龍出現，後面隊伍應該有兩倍長，還好來的巧。\n明太子法棍🥖有嚼勁，上顎痛，明太子不死鹹蠻香的，但可能台北也有這般好吃麵包店??\n還有買鹹麵包明天吃了才知道口味如何！真的是碳水大爆發",
        "photo": "images/3_Full_full_フルフル_パンとワイン.jpg",
        "type": "custom"
      },
      {
        "time": "11:30",
        "name": "深耶馬溪",
        "location": {
          "lat": 33.3725,
          "lng": 131.0664
        },
        "note": "去景觀台的路上，紅黃灰各色的樹環繞在車道，是一條愜意的休閒路，至於景觀台的景色就遜色了些",
        "photo": "images/3_深耶馬溪.jpg",
        "type": "spot"
      },
      {
        "time": "14:00",
        "name": "富貴寺",
        "location": {
          "lat": 33.5414,
          "lng": 131.5283
        },
        "note": "登上石階後進入左右兩邊各有一個五百年以上樹齡的大樹，一顆是銀杏一棵是…X木（我忘了），這時剛好有黃色的葉子也有盛開的楓葉🍁，中間是國寶級的古寺，真的值回票價",
        "photo": "images/3_富貴寺.jpg",
        "type": "spot"
      },
      {
        "time": "17:00",
        "name": "別府溫泉",
        "location": {
          "lat": 33.28,
          "lng": 131.5
        },
        "note": "別府海灣讓我感覺很像夏威夷🌺～",
        "photo": null,
        "type": "relax"
      },
      {
        "time": "17:43",
        "name": "天婦羅 とよ常 とよ常 別府駅前店",
        "location": {
          "lat": 33.28020307939606,
          "lng": 131.50207455520325
        },
        "note": "大家吃了早午餐的麵包後就都沒有機會用餐，於是晚上早早就吃飯並且點了滿滿一桌，只能說日本的天婦羅蝦子好吃新鮮，皮衣薄，蔬菜表現稍差一點點，日本米香搭配醬油飯😍讓人多吃兩口\n但是炸的東西真的也是很可怕，吃了後就覺得肚子好飽",
        "photo": "images/3_天婦羅_とよ常_とよ常_別府駅前店.jpg",
        "type": "custom"
      },
      {
        "time": "19:00",
        "name": "別府 Airbnb",
        "location": {
          "lat": 33.28,
          "lng": 131.5
        },
        "note": "",
        "photo": null,
        "type": "hotel"
      },
      {
        "time": "19:59",
        "name": "超市優洛乳",
        "location": {
          "lat": 33.29831744445224,
          "lng": 131.49876924007907
        },
        "note": "好好喝真的好好喝，我最喜歡各個牛奶（牧場）品牌的優若乳，超級好喝好濃好香但好像有點甜…",
        "photo": "images/3_超市優洛乳.jpg",
        "type": "custom"
      }
    ]
  },
  {
    "day": 4,
    "title": "Day 4",
    "date": "",
    "timeline": [
      {
        "time": "06:54",
        "name": "SHIYACOFFEE",
        "location": {
          "lat": 33.3149747690505,
          "lng": 131.4937668004495
        },
        "note": "看起來還不錯咖啡店，點完餐後坐下來本來還是滿心期待，結果沒多久後，就進來了約六大六小的旅客，說真的聽不出來是哪裡人，小孩操著英語，大人講話也有口音，亞洲面孔，但是應該是東南亞的人，破壞了我清幽的咖啡廳之旅….\n食物也還行，咖啡沒有特別好喝～無法讓人驚艷，似乎鄉下地方還是中烘焙與重烘焙為主？",
        "photo": "images/4_SHIYACOFFEE.jpg",
        "type": "custom"
      },
      {
        "time": "06:54",
        "name": "湯霧展望台 湯けむり展望台",
        "location": {
          "lat": 33.315406289304406,
          "lng": 131.48540122214723
        },
        "note": "當一到展望台就被這張圖所吸引著，心想 原來開車時，覺得為什麼眼前這一個山坡會是這樣黃突禿的一大塊，是發生什麼事了嗎？原來是眼前這張圖的關係，所以那塊地會長成那樣？？！！\n丟上G先生後，得到：「歡迎來別府玩溫泉，但請千萬不要被眼前的風景騙了，這裡隨時可能發生超級災難！」\n更深入詢問，鶴見岳（Tsuru no Mine）目前還是活火山，右邊照片是顯示的是鶴見岳火山噴發的熔岩流景觀，但根據歷史記錄和地質調查，這種大規模的熔岩噴發並非近期事件，而是**約7300年前（阿卡霍亞火山灰噴發時期）**的古代噴發所留下的痕跡或重現圖。\n火山的威力這麼厲害，所以這片山坡還是這樣光禿禿的，覺得大自然的力量好敬畏",
        "photo": "images/4_湯霧展望台_湯けむり展望台.jpg",
        "type": "custom"
      },
      {
        "time": "09:52",
        "name": "器ギャラリーhangi.（ハンギ）",
        "location": {
          "lat": 33.315006464758234,
          "lng": 131.48527253873263
        },
        "note": "開車經過時被這棟建築物有點吸走眼晴，查了之後發現原來是賣餐具器皿的店，於是要繞了回來去晃晃～東西不多，但是讓人覺得舒適",
        "photo": "images/4_器ギャラリーhangi.（ハンギ）.jpg",
        "type": "custom"
      },
      {
        "time": "10:17",
        "name": "血池地獄 血の池地獄",
        "location": {
          "lat": 33.327434106041835,
          "lng": 131.4785729521869
        },
        "note": "別府地獄巡禮七池之一～門票500元，可以泡足浴有很大家的購物店？？ 嗯～到此一遊😅",
        "photo": "images/4_血池地獄_血の池地獄.jpg",
        "type": "custom"
      },
      {
        "time": "12:03",
        "name": "阿蘇くじゅう国立公園 城島高原，路段停車",
        "location": {
          "lat": 33.26712916835481,
          "lng": 131.4252881566611
        },
        "note": "",
        "photo": "images/4_阿蘇くじゅう国立公園_城島高原，路段停車.jpg",
        "type": "custom"
      },
      {
        "time": "12:25",
        "name": "由布岳登山口",
        "location": {
          "lat": 33.2661351923098,
          "lng": 131.39504265024758
        },
        "note": "天氣晴朗 黃橙橙的草地，一望無際，一路向上衝，風很大但是很舒服，484能來日本爬山油然而生，好像沒什麼不行～不管哪個國家 秋天真的是去健行登山的好選擇！",
        "photo": "images/4_由布岳登山口.jpg",
        "type": "custom"
      },
      {
        "time": "12:25",
        "name": "Aso-Kuju National 狭霧台",
        "location": {
          "lat": 33.2600794663191,
          "lng": 131.38247154422294
        },
        "note": "",
        "photo": "images/4_Aso-Kuju_National_狭霧台.jpg",
        "type": "custom"
      },
      {
        "time": "12:55",
        "name": "湯布院花卉村 湯布院フローラルヴィレッジ",
        "location": {
          "lat": 33.26746249297583,
          "lng": 131.36569310086287
        },
        "note": "IG網美景點，東西是都可愛可愛啦～不過就不是我的菜😆😆，即便想買的東西似乎都MIC，那就算了～～",
        "photo": "images/4_湯布院花卉村_湯布院フローラルヴィレッジ.jpg",
        "type": "custom"
      },
      {
        "time": "13:41",
        "name": "うな北 湯布院店",
        "location": {
          "lat": 33.26743823220754,
          "lng": 131.36439796731975
        },
        "note": "時間到了該吃飯，即便今天是平日，但這裡還是人頭攢動，泰國人、韓國人、台灣人、當然還是有牆國人，找了一家評價不錯的鰻魚飯，不錯吃～但是價格有點貴，覺得被貴到了QQ",
        "photo": "images/4_うな北_湯布院店.jpg",
        "type": "custom"
      },
      {
        "time": "14:30",
        "name": "湯之坪街道",
        "location": {
          "lat": 33.2667,
          "lng": 131.3583
        },
        "note": "",
        "photo": null,
        "type": "walk"
      },
      {
        "time": "18:00",
        "name": "由布院 Airbnb",
        "location": {
          "lat": 33.26,
          "lng": 131.36
        },
        "note": "",
        "photo": null,
        "type": "hotel"
      },
      {
        "time": "18:00",
        "name": "超市晚餐",
        "location": {
          "lat": 33.26790101974896,
          "lng": 131.36836836317954
        },
        "note": "蔬菜啊～我好想吃蔬菜🥬，這裡也生產豐厚牛，也買來刷刷鍋了～",
        "photo": "images/4_超市晚餐.jpg",
        "type": "custom"
      },
      {
        "time": "19:53",
        "name": "由布釜飯 「心」金鱗湖本店",
        "location": {
          "lat": 33.2679001144519,
          "lng": 131.36836869947211
        },
        "note": "晚餐買外帶，回住宿吃…\n覺得又貴又普….到底在紅什麼！",
        "photo": null,
        "type": "custom"
      },
      {
        "time": "20:31",
        "name": "鞠智",
        "location": {
          "lat": 33.26790076127087,
          "lng": 131.36836843740778
        },
        "note": "看到路上的人手一個銅鑼燒，於是買了一個要四個人一起吃～晚餐後大家都對這銅鑼燒下了好評，餅皮鬆軟濕嫩，紅豆綿密不算甜，而且一個都沉甸甸的，隔天一早一開店等在門口要買回台灣當伴手禮了！",
        "photo": "images/4_鞠智.jpg",
        "type": "custom"
      },
      {
        "time": "20:40",
        "name": "金麟湖",
        "location": {
          "lat": 33.2625,
          "lng": 131.362
        },
        "note": "早上七點的金鱗湖，這次很殘念的是竟然沒有霧氣逼人，讓人有些失望，沒有霧氣的湖～就是一個小爛湖，沒有什麼特別，不過湖邊的日式庭院建築，神社等與楓樹，落葉🍂，小橋流水與鴛鴦，還是別有一番風味的！",
        "photo": "images/4_金麟湖.jpg",
        "type": "spot"
      }
    ]
  },
  {
    "day": 5,
    "title": "Day 5",
    "date": "",
    "timeline": [
      {
        "time": "08:01",
        "name": "7-11早餐",
        "location": {
          "lat": null,
          "lng": null
        },
        "note": "",
        "photo": null,
        "type": "custom"
      },
      {
        "time": "10:39",
        "name": "九重 夢大橋 ",
        "location": {
          "lat": null,
          "lng": null
        },
        "note": "一直猶豫要不要去這個景點，因為這地理位置應該就是高又冷，尤其知道今天是寒流的第一天，一早從湯布院出門時已經有點陰天毛毛雨，但路上有時不時出太陽讓我左右為難，舅媽說有太陽就去吧，於是改變行程去了夢大橋，下車後一股冷意讓大家都想去上廁所，走上吊橋時，風超級大，寒風刺骨，手都凍僵了，而且停下來還會感到橋的晃動，終於拍完兩個瀑布後快速閃回，這時候就開始飄下出雪了，覺得開心🥳\n",
        "photo": "images/5_九重_夢大橋_.jpg",
        "type": "custom"
      },
      {
        "time": "12:24",
        "name": "鍋ヶ滝 瀑布",
        "location": {
          "lat": 33.1167,
          "lng": 131.025
        },
        "note": "聽說這是網紅景點，這是停車後很容易抵達的瀑布，非常好走，目前水量看起來不大，看其他照片，豐沛水量可以整面都是瀑布，楓葉🍁也是落得早，目前都沒有什麼🍁可以欣賞",
        "photo": "images/5_鍋ヶ滝_瀑布.jpg",
        "type": "spot"
      },
      {
        "time": "15:05",
        "name": "黑川溫泉",
        "location": {
          "lat": 33.0783,
          "lng": 131.1394
        },
        "note": "今天買了生乳泡芙，但是還沒吃….. 我們戰鬥力太弱了～我就等著看何時才會吃。\n黑川溫泉區域廣大，每家溫泉旅館的風格不一樣，對於愛泡湯的人來說，有七種溫泉泉源可以泡～可以一魚多吃",
        "photo": "images/5_黑川溫泉.jpg",
        "type": "relax"
      },
      {
        "time": "15:05",
        "name": "山みず木",
        "location": {
          "lat": 33.08,
          "lng": 131.14
        },
        "note": "房間超大，陽台上有兩張大搖椅可以面溪，欣賞秋天景色，陽光灑下，都是黃橙橙溫暖的顏色，喝杯咖啡吃個小點，讓人著迷….\n但伙食表現欠佳～泡湯舒服暖活，還是低於10度的氣溫泡湯最舒服了",
        "photo": "images/5_山みず木.jpg",
        "type": "hotel"
      },
      {
        "time": "21:37",
        "name": "到處喝優若乳",
        "location": {
          "lat": null,
          "lng": null
        },
        "note": "黑川溫泉附近出品的優洛乳，喝起來奶香濃郁，口感不濃稠，酸甜適中，但價格偏高，還是好吃😋",
        "photo": "images/5_到處喝優若乳.jpg",
        "type": "custom"
      },
      {
        "time": "21:37",
        "name": "一直繼續喝優若乳",
        "location": {
          "lat": null,
          "lng": null
        },
        "note": "九州阿蘇地區鮮乳品牌，阿蘇小國，我喝了三大罐～大約都600ml 左右，口感濃厚，呈膏狀，不酸偏甜，奶香十足，好好喝唷❤️",
        "photo": "images/5_一直繼續喝優若乳.jpg",
        "type": "custom"
      }
    ]
  },
  {
    "day": 6,
    "title": "Day 6",
    "date": "",
    "timeline": [
      {
        "time": "09:43",
        "name": "阿蘇大觀峰",
        "location": {
          "lat": 33.0333,
          "lng": 131.0833
        },
        "note": "一開始不知道為什麼叫大觀峰，爬上去後才知道這是可以360都可以看到view 的景觀點，藍天白雲心曠神怡",
        "photo": "images/6_阿蘇大觀峰.jpg",
        "type": "spot"
      },
      {
        "time": "11:30",
        "name": "Kusasenri Coffee Roastery 草千里珈琲焙煎所",
        "location": {
          "lat": null,
          "lng": null
        },
        "note": "就….又是一個中焙度的咖啡，看這規模應該是知名的品牌，是真的沒有好吃，但在寒風刺骨的阿蘇火山國家公園喝到熱熱的咖啡，我還能計較什麼呢！",
        "photo": "images/6_Kusasenri_Coffee_Roastery_草千里珈琲焙煎所.jpg",
        "type": "custom"
      },
      {
        "time": "12:36",
        "name": "草千里",
        "location": {
          "lat": 32.8842,
          "lng": 131.0514
        },
        "note": "走上大草原斜坡可以看到醜醜的火山口，有看到直升機🚁載客來來去去看火山口～其實也是想搭看看，但只有我一個人上去似乎有點無趣，只好期待下次囉～",
        "photo": "images/6_草千里.jpg",
        "type": "spot"
      },
      {
        "time": "13:26",
        "name": "Asobo no Sato Kugino Roadside Station 道の駅 あそ望の郷くぎの",
        "location": {
          "lat": null,
          "lng": null
        },
        "note": "特地來這一個道の駅，有很大片的波波草，也在這裡買了兩種草莓🍓，一個是淡雪，一種是常見的紅草莓，都很好吃！紅的甜 淡雪很香為偏酸，但都是很棒的體驗，另外這家休息站旁邊Montbell 很好買且又可以退稅～大家買的都很開心！讚讚讚",
        "photo": "images/6_Asobo_no_Sato_Kugino_Roadside_Station_道の駅_あそ望の郷くぎの.jpg",
        "type": "custom"
      },
      {
        "time": "16:56",
        "name": "Hotel Takachiho",
        "location": {
          "lat": 32.71,
          "lng": 131.3
        },
        "note": "這飯店榮登我這趟旅行最不愛的住宿了～覺得太貴沒有那價值，但也怪我，當初想訂的那家飯店太晚下手導致只能訂這家，讓人不開心….\n所以說，住宿還是要下好離手！",
        "photo": null,
        "type": "hotel"
      },
      {
        "time": "20:49",
        "name": "超商早餐",
        "location": {
          "lat": null,
          "lng": null
        },
        "note": "",
        "photo": null,
        "type": "custom"
      },
      {
        "time": "20:55",
        "name": "不同品牌的優洛乳",
        "location": {
          "lat": null,
          "lng": null
        },
        "note": "阿蘇牛奶品牌，🍺起來是最不甜的，而且偏酸，口感也是超級🎉，我覺得我真的很強，喝超多這類產品，大好き！！",
        "photo": "images/6_不同品牌的優洛乳.jpg",
        "type": "custom"
      }
    ]
  },
  {
    "day": 7,
    "title": "Day 7",
    "date": "",
    "timeline": [
      {
        "time": "09:43",
        "name": "高千穗峽",
        "location": {
          "lat": 32.705,
          "lng": 131.3
        },
        "note": "高千穗峽谷，就是要出大太陽有藍天拍照才會好看的地方啊～但是今天是陰天….\n划船最多坐三個人～於是預訂了兩艘船～有點興奮有點害怕，害怕不知道划的好不好～\n不過事實證明，我還是挺厲害的！嘿嘿\n風景很漂亮環境優美，是值得推薦來的景點，但是住宿可能就要挑一下，而且這個地區的住宿費偏高….",
        "photo": "images/7_高千穗峽.jpg",
        "type": "spot"
      },
      {
        "time": "10:08",
        "name": "高千穗牛燒肉 和",
        "location": {
          "lat": 32.71,
          "lng": 131.305
        },
        "note": "11:00不到 已到店家等待，店裡有鐵板燒，燒肉，個人鐵板三種方式吃法，我選的是沙朗個人150公克鐵板，我給其他人選擇150克A5 特選牛排～\n我只能說～我現在已經無法吃這種油膩的東西了！還是肉感重的才好懷念佛羅倫斯的丁骨牛排了….",
        "photo": "images/7_高千穗牛燒肉_和.jpg",
        "type": "food"
      },
      {
        "time": "13:45",
        "name": "水前寺成趣園",
        "location": {
          "lat": 32.79,
          "lng": 130.73
        },
        "note": "下午抵達時陽光☀️正溫暖著，出現藍天白雲，打開車門被太陽騙了，風大的時候還是好冷啊🥶\n日式庭園慢慢散步，餵食鴛鴦～牠們好猛，遠遠飛來搶食，可憐鯉魚都吃不到～這步調好慢好休閒",
        "photo": "images/7_水前寺成趣園.jpg",
        "type": "spot"
      },
      {
        "time": "18:09",
        "name": "三井花園飯店 熊本",
        "location": {
          "lat": 32.79,
          "lng": 130.73
        },
        "note": "",
        "photo": null,
        "type": "hotel"
      },
      {
        "time": "19:54",
        "name": "熊本拉麵黑亭 櫻町熊本城前店 ",
        "location": {
          "lat": null,
          "lng": null
        },
        "note": "",
        "photo": "images/7_熊本拉麵黑亭_櫻町熊本城前店_.jpg",
        "type": "custom"
      },
      {
        "time": "21:53",
        "name": "熊本城",
        "location": {
          "lat": null,
          "lng": null
        },
        "note": "來到熊本怎麼能不來熊本城呢！還是來衝一波了，佔地超廣，而且遊客多～城堡前剛好有一顆盛開的銀杏，真是拍照最佳地點！",
        "photo": "images/7_熊本城.jpg",
        "type": "custom"
      }
    ]
  },
  {
    "day": 8,
    "title": "Day 8",
    "date": "",
    "timeline": [
      {
        "time": "11:30",
        "name": "熊本機場",
        "location": {
          "lat": 32.8372,
          "lng": 130.8569
        },
        "note": "",
        "photo": null,
        "type": "transport"
      }
    ]
  }
];